---
# Obtención Valor UF

Se pide confeccionar un programa en python para la obtención de la uf del mes de Octubre de 2023 y posteriormente **almacenarla en una planilla excel** tal como el siguiente ejemplo.


| Dia | Valor |
|---|---|
| 1 | 29936.45 |
| 2 | 29947.64 |
| 3 | 29956.23 |
| 4 | 30016.98 |
| ... | ... |


La siguiente url contiene datos del valor de la UF.

    http://www.sii.cl/valores_y_fechas/uf/uf2023.htm

In [17]:
import pandas as pd
import numpy as np

In [4]:
url = 'http://www.sii.cl/valores_y_fechas/uf/uf2023.htm'
tables = pd.read_html(url)

In [14]:
df = tables[1]
df

    Noviembre Noviembre.1  Noviembre.2 Noviembre.3  Noviembre.4 Noviembre.5
0         1.0   36.396,26         11.0   36.471,55           21   36.520,11
1         2.0   36.404,45         12.0   36.476,40           22   36.524,97
2         3.0   36.412,64         13.0   36.481,25           23   36.529,83
3         4.0   36.420,84         14.0   36.486,11           24   36.534,69
4         5.0   36.429,03         15.0   36.490,96           25   36.539,55
5         6.0   36.437,23         16.0   36.495,82           26   36.544,42
6         7.0   36.445,43         17.0   36.500,68           27   36.549,28
7         8.0   36.453,63         18.0   36.505,53           28   36.554,14
8         9.0   36.461,84         19.0   36.510,39           29   36.559,01
9        10.0   36.466,69         20.0   36.515,25           30   36.563,87
10        NaN         NaN          NaN         NaN           31         NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Noviembre    10 non-null     float64
 1   Noviembre.1  10 non-null     object
 2   Noviembre.2  10 non-null     float64
 3   Noviembre.3  10 non-null     object
 4   Noviembre.4  11 non-null     int64
 5   Noviembre.5  10 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 660.0+ bytes

In [16]:
df.isna().sum()

Noviembre      1
Noviembre.1    1
Noviembre.2    1
Noviembre.3    1
Noviembre.4    0
Noviembre.5    1
dtype: int64

In [19]:
missing_tokens = ["--", "n/a", "na", "NA", "NaN", ""]
df = df.replace(missing_tokens, np.nan)
df

    Noviembre Noviembre.1  Noviembre.2 Noviembre.3  Noviembre.4 Noviembre.5
0         1.0   36.396,26         11.0   36.471,55           21   36.520,11
1         2.0   36.404,45         12.0   36.476,40           22   36.524,97
2         3.0   36.412,64         13.0   36.481,25           23   36.529,83
3         4.0   36.420,84         14.0   36.486,11           24   36.534,69
4         5.0   36.429,03         15.0   36.490,96           25   36.539,55
5         6.0   36.437,23         16.0   36.495,82           26   36.544,42
6         7.0   36.445,43         17.0   36.500,68           27   36.549,28
7         8.0   36.453,63         18.0   36.505,53           28   36.554,14
8         9.0   36.461,84         19.0   36.510,39           29   36.559,01
9        10.0   36.466,69         20.0   36.515,25           30   36.563,87
10        NaN         NaN          NaN         NaN           31         NaN

In [20]:
duplicadas = df.duplicated().sum()
print("Filas duplicadas:", duplicadas)

if duplicadas > 0:
    df = df.drop_duplicates()

print("Filas, Columnas (después de duplicados):", df.shape)

Filas duplicadas: 0
Filas, Columnas (después de duplicados): (11, 6)

In [21]:
numeric_cols = ["Noviembre.1", "Noviembre.3", "Noviembre.5"]

for col in numeric_cols:
    df[col] = pd.to_numeric(df[col], errors="coerce")

print(df.dtypes)
df.head()

Noviembre      float64
Noviembre.1    float64
Noviembre.2    float64
Noviembre.3    float64
Noviembre.4      int64
Noviembre.5    float64
dtype: object

   Noviembre  Noviembre.1  Noviembre.2  Noviembre.3  Noviembre.4  Noviembre.5
0        1.0          NaN         11.0          NaN           21          NaN
1        2.0          NaN         12.0          NaN           22          NaN
2        3.0          NaN         13.0          NaN           23          NaN
3        4.0          NaN         14.0          NaN           24          NaN
4        5.0          NaN         15.0          NaN           25          NaN